Revit 2024 API
Selection.SetReferences Method
 Selects the references. The references can be an element or a subelement in the host or a linked document.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public void SetReferences(
	IList<Reference> references
)
Visual Basic
Public Sub SetReferences ( _
	references As IList(Of Reference) _
)
Visual C++
public:
void SetReferences(
	IList<Reference^>^ references
)
Parameters
references
Type: System.Collections.Generic.IList<Reference>
 The references to be selected.
Remarks
 This function will select the specified references and update the UI.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Changing the selection is not permitted while handling SelectionChanged Event.
See Also
Selection Class
Autodesk.Revit.UI.Selection Namespace